[{"id":1,"questionId":1,"body":"It definitely wasn't easy in the beginning but now it's fine. It feels like the two \"muscle memories\" are stored separately. My brain and my fingers just use the one relevant for the current keyboard and the two systems don't interfere. Learning to use the ErgoDox actually fixed my typing on regular keyboards. My pinkies for example would never touch any alphanumeric keys before I switched. Now they have many more responsibilities than just holding shift and staying out of the way. The few times I've been away from the Ergo/Moonlander and been exclusively using the built-in keyboard for a week or more because holidays or whatever, there's a short run-in period of 15-30 mins where the layout feels slightly foreign. It's not broken, it's just like the very first time on your skis in a new season. Take two turns and you're back where you left off.","createdAt":1658790312377,"updatedAt":1658790312377},
{"id":2,"questionId":2,"body":"Not yet! It won't be here before late May. Will update here when I get it and have used it for a while. Update: I've had it for a bit now. It's really good. Not sure it's that much better, given the enormous price difference but I don't regret it.","createdAt":1658790865125,"updatedAt":1658790865125},
{"id":3,"questionId":3,"body":"Thank you for that question, Mikkel. I guess nobody's asked me anything yet. Let's hope they do soon!","createdAt":1658790865125,"updatedAt":1658790865125},
{"id":4,"questionId":4,"body":"You mean like some kind of throttling mechanism to disallow multiple likes per person? I honestly just couldn’t be bothered. If someone wants to vandalize it a number on the internet goes up. I can live with that.","createdAt":1658790865125,"updatedAt":1658790865125},
{"id":5,"questionId":5,"body":"It's a very expensive and cumbersome way to show your friends that you have an exquisite taste in computer graphics.","createdAt":1658791118595,"updatedAt":1658791118595},
{"id":6,"questionId":6,"body":"Too many to mention, I'll have to write one of those `/uses` pages ([I did!](/uses)). I'm really enjoying HEY's take on e-mail and Safari is an amazing browser. Best of them all.","createdAt":1658791118596,"updatedAt":1658791118596},
{"id":7,"questionId":7,"body":"I took a photo of myself with my iPhone’s selfie cam then ran it through the Prisma iPhone app with some filter. Finally I changed the colors a bit in Acorn to my likes.\t","createdAt":1658791118596,"updatedAt":1658791118596},
{"id":8,"questionId":8,"body":"According to my friend from whom I bought them: \"Lilacs lubed with Krytox 205g0 and 105 on spring. Filmed with 0.15mm TX switch films v2.\" I know what some of those things mean. These are linear and I've mostly used tactiles before. Takes a little getting used to but liking it.\t","createdAt":1658791118596,"updatedAt":1658791118596},
{"id":9,"questionId":9,"body":"<a href=\"https://configure.zsa.io/moonlander/layouts/xbNqp/latest/0\">This one</a>. Almost the same as the one I used on my Ergodox. There's a whole bunch of keys that I almost never touch. I would gladly trade <a href=\"https://s3.brnbw.com/CleanShot-2021-04-12-at-15.42.21-2x-vyiEuPk0LVomiH2JL7lVVboONCkehMX73wMLX6lYwbRp6QSn3vy0jUt70zNCKGzow1wnHMQYgWojgu5rjdI8nrvpCzgedyZ60KZM.png\">these keys</a> for a slightly smaller footprint.","createdAt":1658791118596,"updatedAt":1658791118596},
{"id":10,"questionId":10,"body":"It's hard to count. Both because I've tried many but also because it's hard to define at what point you know a language. I love Ruby and it's the one I have the most experience with. JavaScript is fun too. Swift is nice. When you know a few syntaxes, you can learn new ones fairly quickly. What takes time is getting experience and there's no other way to get that than to write a whole lot of code. So I suggest to just pick one and get going. Preferably on a \"real\" project, whatever that means. But having an end goal is definitely an effective driving factor.\t","createdAt":1658791312548,"updatedAt":1658791312548},
{"id":11,"questionId":11,"body":"I think Tailwind is wonderful in production! What I think you might be concerned about is the size of the CSS file? Tailwind has purgecss built in which will remove all unused classes in production. (The new JIT mode does this too but the other way around as it only adds the classes you’re using instead.) As long as you make sure to include this step somewhere in your deployment process I can’t see why there would be any problem with using Tailwind, in production nor otherwise.","createdAt":1658791312548,"updatedAt":1658791312548},
{"id":12,"questionId":12,"body":"I use <a href=\"https://qsapp.com/\">Quicksilver</a> and have not been able to get used to any of the alternatives. So I wish that a <em>more healthy and maintained</em> version of Quicksilver existed. <a href=\"https://twitter.com/mikker/status/1324257873342464001\">I have actually begun</a> making one myself but it's a humongous task so don't expect anything. It'll be my magnum opus.","createdAt":1658791312549,"updatedAt":1658791312549},
{"id":13,"questionId":13,"body":"I completed high school (almen gymnasium 🇩🇰) in 2005. After taking a break, working some, spending half a year on a højskole playing jazz drums, I started Information Studies at the university in Århus in 2007. After 1.5-2 years I dropped out to be on TV doing my new(est) hobby, stand-up comedy, thinking I'd come back and finish the bachelor's degree. I never did. Got my first full-time job programming in 2013.\\n\\nWhen I was 12 (1998) my father brought home a pamphlet sized book about making websites with HTML. I wanted to make one because my 10-year-older cousin had showed me his and I thought it was the most beautiful thing I'd ever seen. I spent the whole weekend making a website about... nothing? and I had the best time doing it. Found a few friends with the same interest in this weird medium. We'd keep redoing our own websites every month or few weeks even, always trying to one-up or just impress each other. At some point people started paying me money to make their websites.\\n\\nThat's 23 years ago now and I just now realized that's still mostly what I do. I just have more friends to show it to these days and the possibilities have expanded immensely.","createdAt":1658791312549,"updatedAt":1658791312549},
{"id":14,"questionId":14,"body":"To be fair, the only project that's generating any <em>\"serious\"</em> revenue is 10er. <a href=\"https://twitter.com/mikker/status/1396937534329004035?s=20\">The tweet</a> you're referring to was a bit sarcastic, ha! But thank you none the less.  I will go solo at some point -- but not quite yet. To be brutally honest: I like the money I make at Elastic. The job is nice too, my coworkers are wonderful and Elastic is an amazing company.","createdAt":1658863012982,"updatedAt":1658863012982},
{"id":15,"questionId":15,"body":"I have! I wrote <a href=\"https://www.dr.dk/om-dr/nyheder/dr-nyheders-chatbot-har-indtaget-facebook\">DR News' Facebook chatbot</a> in it back in 2018 when those were all the rage. I like it a lot. I think it's superior to Ruby and Rails in many ways but also a bit more cumbersome in day-to-day use. That's why I've stuck with Rails for new projects; I can just move faster. Which is a good thing to optimise for when you're a single developer.<br/><br/>Learning Elixir and OTP is one of those processes where you start off being confident then your mind is completely blown and you look into the abyss and think <em>\"How can anyone get anything done then?\"</em> but then, slowly, you regain your sense of the world and can see everything, Elixir and in general, in a new light. I learned through <a href=\"https://pragprog.com/titles/elixir16/programming-elixir-1-6/\">this book</a> and it was a great introduction.<br /><br />If I was building something where ability to scale was critical or something heavy on WebSockets for example, I would 100% go with Elixir/Phoenix. It's a wonderful language and framework.","createdAt":1658863012982,"updatedAt":1658863012982},
{"id":16,"questionId":16,"body":"Sure, everyone ought to at least try it. It might stick, it might not. No sweat. One thing I can say is that I, as a coder who \"can design\", feel it's a superpower. Talking to designers becomes so much easier and suddenly you can make things completely on your own. I also feel, as a design who \"can code\" that the same is just as true from that direction. Same goes for doing \"customer support\" properly. \"Marketing\", all of it. If you're curious, you can learn the basics of almost anything. If you're humble and dare to put yourself out there, nothing's out of reach. An annoyingly fluffy statement but I believe it.","createdAt":1658863012982,"updatedAt":1658863012982},
{"id":17,"questionId":17,"body":"Long time fan and follower of Basecamp, their apps, their books – the whole deal. When I first read the announcement blog post, I was confused. Felt like the wrong direction. So I read a ton of Twitter threads and blog posts. I only know the situation from what's been written publicly and what's been leaked in articles, but I was honestly a bit disappointed, as a fan, over both the stance and how it was all handled. Still am a fan, albeit a slightly more confused one.","createdAt":1658863012983,"updatedAt":1658863012983},
{"id":18,"questionId":18,"body":"Yes","createdAt":1658863012983,"updatedAt":1658863012983},
{"id":19,"questionId":19,"body":"I could see myself do that if I feels there's a match 👍 Hit me up via e-mail with maybe any specific questions you have and we can figure something out.","createdAt":1658863012983,"updatedAt":1658863012983},
{"id":20,"questionId":20,"body":"Yes, I do miss it sometimes. And I miss being part of \"the comedy circuit.\" At the same time I feel we ended at a good time. While we were still on top but also not too late. We've briefly discussed making more episodes but only want to do so if we can do it like we used to: 3 people together in a room with bad audio and a bottle of Fanta Exotic.","createdAt":1658863012983,"updatedAt":1658863012983},
{"id":21,"questionId":21,"body":"Not really, no. I post some jokes on Twitter and every once in a while Instagram. Maybe I will come back to it at som point but for now I'm enjoying actually giving myself permission to say that no, I don't do comedy anymore.","createdAt":1658863012983,"updatedAt":1658863012983},
{"id":22,"questionId":22,"body":"Sadly not, no. The code for the \"apps\" I built for it is on GitHub at <a href=\"https://github.com/ny-mappe-1\">Ny Mappe (1)</a>","createdAt":1658863012983,"updatedAt":1658863012983},
{"id":23,"questionId":23,"body":"Yes, they are! <a href=\"https://s3-brnbw-com.s3-eu-west-1.amazonaws.com/a-Jingles-O94Ls7IYulWVP4wt1qPE7HYlqTcIX8mOj1qkrnT3yVOIiONuTxSkAla60Am3HozYFSZEIf3xXkxo59NSEg0Ue84v9PpO62pntA0S.zip\">Download here (49,5 MB)</a>.","createdAt":1658863290689,"updatedAt":1658863290689},
{"id":24,"questionId":24,"body":"Ha! There were some talks back in the day but it never got anywhere.","createdAt":1658863290689,"updatedAt":1658863290689},
{"id":25,"questionId":25,"body":"I got started programming by building my own website when I was 12. Having nothing else to share but \"Welcome to my homepage!\" I just kept redoing it. A few of my friends did the same and trying to impress each other we learnt more and more things, eventually upgrading from static HTML to PHP and then adding CSS and on and on. So, my background is being curious. You might already have great taste but if not you need to develop it. When you go about on the internet, take note of things and styles that you like. Notice trends in visual design. Sometimes everything looks skeumorphic like real world surfaces, sometimes they can't be flat enough and the slightest drop shadow is forbidden. Don't spend too much energy on whether you like these trends or not, just notice them come and go and try to discern what they're about and consider what goes into designing like that. The key isn't to know what's hot but at the forefront but to train yourself into noticing what's becoming popular, what you like and don't like and have a feeling of what goes into actually making things look in a certain way. Then all that's left is to practice. You can study without doing but to learn, you need to do. So mimic and copy and try and fail and try again. Could be building your personal website. Doesn't really matter what it is. But you need to practice -- of course!","createdAt":1658863290689,"updatedAt":1658863290689},
{"id":26,"questionId":26,"body":"I followed Ethereum for years, never got bitten. Hustling shitcoins or playing bank just didn't interest me enough. NFTs convinced me. Started collecting a bit and participating on Twitter. But to really learn and understand I need to get my hands dirty. So I jumped in.","createdAt":1658863290689,"updatedAt":1658863290689},
{"id":27,"questionId":27,"body":"<a href=\"https://twitter.com/mikker/status/1397909545335201793\">Yes</a>! Or, sort of. I've created my own ERC20 token on the Ethereum blockchain which can act like any other token (\"currency\") on that network. For now I'm just giving them away to friends.","createdAt":1658863290689,"updatedAt":1658863290689},
{"id":28,"questionId":28,"body":"It has first and foremost been very fun and exciting – and very lucrative so far. I like new things and Ethereum was all new to me. It's definitely more stressful than your typical ol' Web2.0 web/app project as there's mostly no undo and the sums of internet money are potentially gigantic. I still haven't decided whether I'm sure Eth/crypto/blockchain will be the future, but it could be a future and it's fun to be exploring the forefront of that potential future. I don't like Proof of Work and its energy use. Eth's move to Proof of Stake can't come soon enough. I don't like the huge transaction fees of now. I don't like the pump'n'dump culture, I don't enjoy hanging in Discords all day. I'm working with a few artists to release their collections and I'm working on an entirely new NFT experiment that I'll probably release this month or the next.","createdAt":1658863290689,"updatedAt":1658863290689},
{"id":29,"questionId":29,"body":"Maybe. I've got a few collaborations on the timeline already. But send me an e-mail or a Twitter DM and we'll see.","createdAt":1658863290689,"updatedAt":1658863290689},
{"id":30,"questionId":30,"body":"Nope. The future is set in stone. Every year 1,000 new Cranes will be made available and if they all sell, special editions will be made available for free to all holders and hodlers.","createdAt":1658863290689,"updatedAt":1658863290689},
{"id":31,"questionId":31,"body":"Thank you! The art is all James and you're right, they're very cute! I think you have it right. You draw each version of each part in a layer, then have the random machine pick a random version for each part. I know nothing about After Effects but that's how I imagine it's done.","createdAt":1658863335023,"updatedAt":1658863335023},
{"id":32,"questionId":32,"body":"mikkel@brnbw.com","createdAt":1658950132842,"updatedAt":1658950132842},
{"id":33,"questionId":33,"body":"Thank you too! No concrete plans yet but I don’t think I can go too long without any form of longer form outlet.","createdAt":1658950132842,"updatedAt":1658950132842},
{"id":34,"questionId":34,"body":"James did all the actual artwork for SlimHoods so I can only speak for all the things that happens after you have a folder full of cute animated character loops. On Ethereum contracts are written in a programming language called Solidity. Being on the blockchain there’s a whole bunch of things that are more stressful and serious than, say, working on the web. The contract follows a standard called ERC721. The SlimHoods website is built with a bunch of tools. Most notably Next.js, Hardhat, Ethers.js and TailwindCSS. All of these are broadly used tools so there are a million tutorials and other resources for each of them available. I suggest you look up a tutorial or 20 and learn through doing them. It’ll all be very confusing at first but that’s only because you don’t know it yet. Stick with it and you’ll be able to do everything I can do (and more!)","createdAt":1658950132842,"updatedAt":1658950132842},
{"id":35,"questionId":35,"body":"I do enjoy sci-fi! I keep <a href=\"https://www.goodreads.com/review/list/8548698?shelf=read\">a list of the books I've read</a>. If it's on the list it means it was good enough to keep me entertained all the way through. If it has five stars, it was so good that I'd recommend it to anyone.","createdAt":1658950132842,"updatedAt":1658950132842},
{"id":36,"questionId":36,"body":"<a href=\"https://mikkelmalmberg.com/uses\">Now!</a>","createdAt":1658950132842,"updatedAt":1658950132842},
{"id":37,"questionId":37,"body":"Please go to the counter over by the vending machines, madam.","createdAt":1658950132843,"updatedAt":1658950132843},
{"id":38,"questionId":38,"body":"I do enjoy sci-fi! I keep <a href=\"https://www.goodreads.com/review/list/8548698?shelf=read\">a list of the books I've read</a>. If it's on the list it means it was good enough to keep me entertained all the way through. If it has five stars, it was so good that I'd recommend it to anyone.","createdAt":1658950339973,"updatedAt":1658950339973},
{"id":39,"questionId":39,"body":"There’s two now!","createdAt":1658950339973,"updatedAt":1658950339973},
{"id":40,"questionId":40,"body":"Nej","createdAt":1658950339973,"updatedAt":1658950339973},
{"id":41,"questionId":41,"body":"Pondering my orb. i got it at a builders market called Bauhaus for almost nothing. I’ve put a Philips Hue bulb in there and my kids love to change it to colored light. Only recently did I realize that the name Bauhaus literally translates to “build house” in German.","createdAt":1658950339974,"updatedAt":1658950339974},
{"id":42,"questionId":42,"body":"<a href=\"https://rsms.me/inter/\">Inter</a> by <a href=\"http://twitter.com/rsms\">@rsms</a>","createdAt":1658950339974,"updatedAt":1658950339974},
{"id":43,"questionId":43,"body":"Didn’t go with ERC721A, as they call it. As almost everyone only got to mint one, there was little benefit to switch away from tried and tested OpenZeppelin.","createdAt":1658950339974,"updatedAt":1658950339974},
{"id":44,"questionId":44,"body":"There is definitely a high cost to participate on Ethereum right now. It's sad and sadly not going to get much better for the foreseeable future. Eventually, hopefully, but not soon.<br /><br />I do enjoy however to <a href=\"http://mikker.tez.page\">collect on the Tezos blockchain</a> too where there's a sprawling art community, way lower fees and prices in general. Tezos is Proof of Stake-based already so its energy use is also way lower.","createdAt":1658950339974,"updatedAt":1658950339974},
{"id":45,"questionId":45,"body":"I made my own project, <a href=\"http://cranes.supply\">cranes.supply</a>. James of SlimHoods saw it and asked if I could help him release his collection.","createdAt":1658950488508,"updatedAt":1658950488508},
{"id":46,"questionId":46,"body":"Deliberate practice. Observe, identify, practice.","createdAt":1658950488508,"updatedAt":1658950488508},
{"id":47,"questionId":47,"body":"Just, little by little. Start, then keep going, then – eventually, but critically important – ship.","createdAt":1658950488508,"updatedAt":1658950488508},
{"id":48,"questionId":48,"body":"I use <a href=\"https://nextjs.org\">Next.js</a> on <a href=\"https://vercel.com\">Vercel</a> and that makes it so you almost don't have to worry about scaling.<br /><br />You can still shoot yourself in the foot but how not to do that is a bit hard to boil down to an answer here. Experience, I guess.","createdAt":1658950488508,"updatedAt":1658950488508},
{"id":49,"questionId":49,"body":"She has her own <a href=\"https://ammero.dk\">midwife business</a> and she is awesome ❤️","createdAt":1658950488508,"updatedAt":1658950488508},
{"id":50,"questionId":50,"body":"<a href=\"https://stripe.com\">Stripe</a>, I guess. Or maybe <a href=\"https://dinero.dk\">Dinero</a> if you’re in Denmark.","createdAt":1658950488508,"updatedAt":1658950488508}]
